{"keras_version": "1.2.1", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\"\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "output_shape": null}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "nb_row": 5, "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "nb_row": 5, "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "nb_row": 5, "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "nb_row": 3, "name": "convolution2d_4", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_constraint": null, "nb_row": 3, "name": "convolution2d_5", "b_regularizer": null, "trainable": true, "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 64, "name": "dense_1", "output_dim": 1164, "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 1164, "name": "dense_2", "output_dim": 100, "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 100, "name": "dense_3", "output_dim": 50, "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_8", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 50, "name": "dense_4", "output_dim": 10, "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_9", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dim": 10, "name": "dense_5", "output_dim": 1, "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}